packages/CustomFeature/Question/src/Repositories/QuestionRepository.php

    public function create(array $data)
    {
        DB::beginTransaction();

        try {
            // Generate slug if not provided
            if (empty($data['slug'])) {
                $data['slug'] = Str::slug($data['title']);
            }

            // Create main question
            $question = $this->model->create([
                'title'       => $data['title'],
                'short_title' => $data['short_title'],
                'slug'        => $data['slug'],
                'status'      => $data['status'] ?? 0,
                'is_premium'  => $data['is_premium'] ?? 0,
            ]);

            // Create assignments
            if (! empty($data['assignments'])) {
                foreach ($data['assignments'] as $assignment) {
                    $question->assignments()->create([
                        'board_id'   => $assignment['board_id'],
                        'grade_id'   => $assignment['grade_id'],
                        'subject_id' => $assignment['subject_id'],
                        'book_id'    => $assignment['book_id'],
                        'chapter_id' => $assignment['chapter_id'],
                    ]);
---
insert into `questions` (`title`, `short_title`, `slug`, `top_description`, `bottom_description`, `related_links`, `meta_title`, `meta_description`, `meta_keywords`, `status`, `is_premium`, `updated_at`, `created_at`) values ('cfvgbhnjm', 'tgyhujkl', 'cfvgbhnjm', null, null, null, null, null, null, 1, 0, '2026-02-26 02:18:37', '2026-02-26 02:18:37')
insert into `question_assignments` (`board_id`, `grade_id`, `subject_id`, `book_id`, `chapter_id`, `question_id`, `updated_at`, `created_at`) values ('1', '4', '4', '3', '9', 3, '2026-02-26 02:18:37', '2026-02-26 02:18:37')