packages/CustomFeature/Question/src/Http/Controllers/QuestionController.php

    public function addQuestionItem(Request $request, $id)
    {
        $request->validate([
            'question_number' => 'required|string',
            'question'        => 'required|string',
            'answer'          => 'required|string',
            'page_number'     => 'nullable|string',
        ]);

        $question = $this->questionRepository->findOrFail($id);

        $item = $question->questionItems()->create([
            'question_number' => $request->question_number,
            'question'        => $request->question,
            'answer'          => $request->answer,
            'page_number'     => $request->page_number,
            'order'           => $request->order ?? $question->questionItems()->count(),
        ]);
---
insert into `question_items` (`question_number`, `question`, `answer`, `page_number`, `order`, `question_id`, `updated_at`, `created_at`) values ('Question 2', '<p>question 2 added</p>', '<p>answer 2 added</p>', '88', 1, 1, '2026-02-26 23:24:20', '2026-02-26 23:24:20')
select count(*) as aggregate from `question_items` where `question_items`.`question_id` = 1 and `question_items`.`question_id` is not null

    public function updateQuestionItem(Request $request, $id, $itemId)
    {
        $request->validate([
            'question_number' => 'required|string',
            'question'        => 'required|string',
            'answer'          => 'required|string',
            'page_number'     => 'nullable|string',
        ]);

        $question = $this->questionRepository->findOrFail($id);

        $item = $question->questionItems()->findOrFail($itemId);

        $item->update([
            'question_number' => $request->question_number,
            'question'        => $request->question,
            'answer'          => $request->answer,
            'page_number'     => $request->page_number,
            'order'           => $request->order ?? $question->questionItems()->count(),
---
select count(*) as aggregate from `question_items` where `question_items`.`question_id` = 1 and `question_items`.`question_id` is not null