packages/CustomFeature/Question/src/Http/Controllers/QuestionController.php

    public function updateQuestionItem(Request $request, $id, $itemId)
    {
        $request->validate([
            'question_number' => 'required|string',
            'question'        => 'required|string',
            'answer'          => 'required|string',
            'page_number'     => 'nullable|string',
            'video_solution'  => 'nullable|string',
        ]);

        $question = $this->questionRepository->findOrFail($id);

        $item = $question->questionItems()->findOrFail($itemId);

        $item->update([
            'question_number' => $request->question_number,
            'question'        => $request->question,
            'answer'          => $request->answer,
            'page_number'     => $request->page_number,
            'order'           => $request->order ?? $item->order ?? $question->questionItems()->count(),
            'video_solution'  => $request->video_solution,
        ]);
---
select * from `question_items` where `question_items`.`question_id` = 1 and `question_items`.`question_id` is not null and `question_items`.`id` = '2' order by `order` asc limit 1